#[allow(non_camel_case_types,dead_code,non_upper_case_globals,non_snake_case,improper_ctypes)]
pub mod downsample_ispc {
/* automatically generated by rust-bindgen 0.59.2 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WeightVariables {
    pub src_center: f32,
    pub src_start: u32,
    pub src_end: u32,
}
#[test]
fn bindgen_test_layout_WeightVariables() {
    assert_eq!(
        ::std::mem::size_of::<WeightVariables>(),
        12usize,
        concat!("Size of: ", stringify!(WeightVariables))
    );
    assert_eq!(
        ::std::mem::align_of::<WeightVariables>(),
        4usize,
        concat!("Alignment of ", stringify!(WeightVariables))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WeightVariables>())).src_center as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WeightVariables),
            "::",
            stringify!(src_center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WeightVariables>())).src_start as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WeightVariables),
            "::",
            stringify!(src_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WeightVariables>())).src_end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WeightVariables),
            "::",
            stringify!(src_end)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WeightCollection {
    pub starts: *const u32,
    pub weight_counts: *const u32,
    pub values: *const *const f32,
}
#[test]
fn bindgen_test_layout_WeightCollection() {
    assert_eq!(
        ::std::mem::size_of::<WeightCollection>(),
        24usize,
        concat!("Size of: ", stringify!(WeightCollection))
    );
    assert_eq!(
        ::std::mem::align_of::<WeightCollection>(),
        8usize,
        concat!("Alignment of ", stringify!(WeightCollection))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WeightCollection>())).starts as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WeightCollection),
            "::",
            stringify!(starts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WeightCollection>())).weight_counts as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WeightCollection),
            "::",
            stringify!(weight_counts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WeightCollection>())).values as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WeightCollection),
            "::",
            stringify!(values)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Cache {
    pub vertical_weights: WeightCollection,
    pub horizontal_weights: WeightCollection,
}
#[test]
fn bindgen_test_layout_Cache() {
    assert_eq!(
        ::std::mem::size_of::<Cache>(),
        48usize,
        concat!("Size of: ", stringify!(Cache))
    );
    assert_eq!(
        ::std::mem::align_of::<Cache>(),
        8usize,
        concat!("Alignment of ", stringify!(Cache))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Cache>())).vertical_weights as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Cache),
            "::",
            stringify!(vertical_weights)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Cache>())).horizontal_weights as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Cache),
            "::",
            stringify!(horizontal_weights)
        )
    );
}
extern "C" {
    pub fn calculate_weight_variables(src: u32, target: u32, out_variables: *mut WeightVariables);
}
extern "C" {
    pub fn calculate_weights(scale: f32, vars: *const WeightVariables, weights: *mut f32);
}
extern "C" {
    pub fn resample(
        width: u32,
        height: u32,
        stride: u32,
        num_channels: u8,
        target_width: u32,
        target_height: u32,
        src_data: *const u8,
        out_data: *mut u8,
    );
}
extern "C" {
    pub fn resample_with_cache(
        src_width: u32,
        src_height: u32,
        target_width: u32,
        target_height: u32,
        num_channels: u8,
        cache: *const Cache,
        scratch_space: *mut u8,
        src_data: *const u8,
        out_data: *mut u8,
    );
}
}
