#[allow(non_camel_case_types,dead_code,non_upper_case_globals,non_snake_case,improper_ctypes)]
pub mod downsample_ispc {
/* automatically generated by rust-bindgen 0.59.2 */

<<<<<<< HEAD
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint32_t = ::std::os::raw::c_uint;
=======
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoefficientVariables {
    pub src_center: f32,
    pub src_start: u32,
    pub src_end: u32,
}
#[test]
fn bindgen_test_layout_CoefficientVariables() {
    assert_eq!(
        ::std::mem::size_of::<CoefficientVariables>(),
        12usize,
        concat!("Size of: ", stringify!(CoefficientVariables))
    );
    assert_eq!(
        ::std::mem::align_of::<CoefficientVariables>(),
        4usize,
        concat!("Alignment of ", stringify!(CoefficientVariables))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoefficientVariables>())).src_center as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoefficientVariables),
            "::",
            stringify!(src_center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoefficientVariables>())).src_start as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoefficientVariables),
            "::",
            stringify!(src_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CoefficientVariables>())).src_end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoefficientVariables),
            "::",
            stringify!(src_end)
        )
    );
}
extern "C" {
    pub fn calculate_coefficient_variables(
        src: u32,
        target: u32,
        out_variables: *mut CoefficientVariables,
    );
}
extern "C" {
    pub fn calculate_coefficients(
        scale: f32,
        vars: *const CoefficientVariables,
        coefficients: *mut f32,
    );
}
>>>>>>> c59bb18 (Add code to calculate the coefficients for the filter separate from the sampling)
extern "C" {
    pub fn resample(
        width: u32,
        height: u32,
        stride: u32,
        num_channels: u8,
        target_width: u32,
        target_height: u32,
        src_data: *const u8,
        out_data: *mut u8,
    );
}
}